ht32-holtek/HT32_STD_7xxxx_FWLib/library/Device/Holtek/HT32F7xxxx/Include/ht32f7xxxx_01.h
/***************************************************************************//**
 * @file    ht32f7xxxx_01.h
 * @brief   CMSIS Cortex-M0+ Device Peripheral Access Layer Header File
 * @version $Rev:: 456          $
 * @date    $Date:: 2026-05-05 #$
 *
 * @note
 * Copyright (C) Holtek Semiconductor Inc. All rights reserved.
 *
 * @par
 * Holtek supplies this software for Cortex-M processor-based
 * microcontrollers.  This file can be freely distributed within
 * development tools that are supporting such ARM-based processors.
 *
 * @par
 * THIS SOFTWARE IS PROVIDED "AS IS".  NO WARRANTIES, WHETHER EXPRESS, IMPLIED
 * OR STATUTORY, INCLUDING, BUT NOT LIMITED TO, IMPLIED WARRANTIES OF
 * MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE APPLY TO THIS SOFTWARE.
 * ARM SHALL NOT, IN ANY CIRCUMSTANCES, BE LIABLE FOR SPECIAL, INCIDENTAL, OR
 * CONSEQUENTIAL DAMAGES, FOR ANY REASON WHATSOEVER.
 *
 ******************************************************************************/

// Supported Device
// ========================================
//   HT32F72368, HT32F72378, HT32F72388

/** @addtogroup CMSIS
  * @{
  */

/** @addtogroup HT32F7xxxx HT32F7xxxx
  * @{
  */


#ifndef __HT32F7XXXX_01_H__
#define __HT32F7XXXX_01_H__

#include "ht32f7_config.h"

#ifdef __cplusplus
 extern "C" {
#endif

#if !defined(USE_HT32F72368_78_88)

  //#define USE_HT32F72368_78_88

#endif

#if !defined(USE_NOCHIP) && \
    !defined(USE_HT32F72368_78_88)

  #error Please add "USE_HT32Fxxxxx_xx" define into C Preprocessor Symbols of the Project configuration.

#endif

/** @addtogroup Library_configuration_section
  * @{
  */
/**
 * @brief Value of the High Speed Internal oscillator in Hz
  */
#define HSI_VALUE      8000000UL   /*!< Value of the High Speed Internal oscillator in Hz                 */

/**
 * @brief Value of the Low Speed Internal oscillator in Hz
  */
#define LSI_VALUE         32000UL     /*!< Value of the Low Speed Internal oscillator in Hz                 */

/**
 * @brief Value of the Low Speed External oscillator in Hz
  */
#define LSE_VALUE         32768UL     /*!< Value of the Low Speed External oscillator in Hz                 */


/**
 * @brief Adjust the High Speed External oscillator (HSE) Startup Timeout value
   */
#define HSE_READY_TIME    ((uint16_t)0xFFFF)    /*!< Time out for HSE start up                              */
/**
  * @}
  */

/** @addtogroup Configuration_section_for_CMSIS
  * @{
  */
#define __MPU_PRESENT             0    /*!< MPU present or not                                              */
#define __VTOR_PRESENT            1    /*!< VTOR present or not                                             */
#define __NVIC_PRIO_BITS          2    /*!< Number of Bits used for Priority Levels                         */
#define __Vendor_SysTickConfig    0    /*!< Set to 1 if different SysTick Config is used                    */

/**
  * @}
  */


/** @addtogroup Configuration_for_Interrupt_Number
  * @{
  */
typedef enum IRQn
{
/****** Cortex-M0+ Processor Exceptions Numbers ********************************                            */
  NonMaskableInt_IRQn     = -14,    /*!< 2 Non Maskable Interrupt                                           */
  HardFault_IRQn          = -13,    /*!< 3 Cortex-M0+ Hard Fault Interrupt                                  */
  SVCall_IRQn             = -5,     /*!< 11 Cortex-M0+ SV Call Interrupt                                    */
  PendSV_IRQn             = -2,     /*!< 14 Cortex-M0+ Pend SV Interrupt                                    */
  SysTick_IRQn            = -1,     /*!< 15 Cortex-M0+ System Tick Interrupt                                */

/******  HT32 Specific Interrupt Numbers ***************************************                            */
  LVD_BOD_IRQn            = 0,      /*!< Low voltage & Brown-out detection interrupt                        */
  RTC_IRQn                = 1,      /*!< RTC Wake-up Interrupt                                              */
  FLASH_IRQn              = 2,      /*!< FLASH global Interrupt                                             */
  EVWUP_IRQn              = 3,      /*!< EXTI Event Wake-up & WAKEUP pin Interrupt                          */
  EXTI0_1_IRQn            = 4,      /*!< EXTI0-1 Line detection Interrupt                                   */
  EXTI2_3_IRQn            = 5,      /*!< EXTI2-3 Line detection Interrupt                                   */
  EXTI4_15_IRQn           = 6,      /*!< EXTI4-15 Line detection Interrupt                                  */
  CMP0_1_DAC_IRQn         = 7,      /*!< Comparator 0-1 & DAC global Interrupt                              */
  ADC0_IRQn               = 8,      /*!< ADC global Interrupt                                               */
  AES_RNG_I2C2_IRQn       = 9,      /*!< AES, RNG & I2C2 global Interrupt                                  */
  MCTM_IRQn               = 10,     /*!< Motor Control Timer interrupt                                      */
  QSPI_IRQn               = 11,     /*!< QSPI global Interrupt                                              */
  GPTM_IRQn               = 12,     /*!< General-Purpose Timer Interrupt                                    */
  SCTM0_IRQn              = 13,     /*!< Single Channel Timer0 Interrupt                                    */
  SCTM1_IRQn              = 14,     /*!< Single Channel Timer1 Interrupt                                    */
  PWM0_IRQn               = 15,     /*!< PWM Timer0 Interrupt                                               */
  PWM1_IRQn               = 16,     /*!< PWM Timer1 Interrupt                                               */
  BFTM0_IRQn              = 17,     /*!< Basic Function Timer0 Interrupt                                    */
  BFTM1_IRQn              = 18,     /*!< Basic Function Timer1 Interrupt                                    */
  I2C0_IRQn               = 19,     /*!< I2C0 global Interrupt                                              */
  I2C1_IRQn               = 20,     /*!< I2C1 global Interrupt                                              */
  SPI0_IRQn               = 21,     /*!< SPI0 global Interrupt                                              */
  SPI1_IRQn               = 22,     /*!< SPI1 global Interrupt                                              */
  USART0_IRQn             = 23,     /*!< USART0 global Interrupt                                            */
  USART1_IRQn             = 24,     /*!< USART1 global Interrupt                                            */
  UART0_UART2_IRQn        = 25,     /*!< UART0 & UART2 global Interrupt                                     */
  UART1_UART3_IRQn        = 26,     /*!< UART1 & UART3 global Interrupt                                     */
  SCI0_1_CAN0_IRQn        = 27,     /*!< Smart Card Interface 0-1 & CAN0 Interrupt                          */
  I2S_CAN1_IRQn           = 28,     /*!< I2S & CAN1 global Interrupt                                        */
  USB_IRQn                = 29,     /*!< USB interrupt                                                      */
  PDMACH0_1_IRQn          = 30,     /*!< PDMA channel 0-1 interrupt                                         */
  PDMACH2_5_IRQn          = 31,     /*!< PDMA channel 2-5 interrupt                                         */
} IRQn_Type;

#define EXTI0_IRQn EXTI0_1_IRQn
#define EXTI1_IRQn EXTI0_1_IRQn
#define EXTI2_IRQn EXTI2_3_IRQn
#define EXTI3_IRQn EXTI2_3_IRQn
#define EXTI4_IRQn EXTI4_15_IRQn
#define EXTI5_IRQn EXTI4_15_IRQn
#define EXTI6_IRQn EXTI4_15_IRQn
#define EXTI7_IRQn EXTI4_15_IRQn
#define EXTI8_IRQn EXTI4_15_IRQn
#define EXTI9_IRQn EXTI4_15_IRQn
#define EXTI10_IRQn EXTI4_15_IRQn
#define EXTI11_IRQn EXTI4_15_IRQn
#define EXTI12_IRQn EXTI4_15_IRQn
#define EXTI13_IRQn EXTI4_15_IRQn
#define EXTI14_IRQn EXTI4_15_IRQn
#define EXTI15_IRQn EXTI4_15_IRQn

#define PDMACH0_IRQn PDMACH0_1_IRQn
#define PDMACH1_IRQn PDMACH0_1_IRQn
#define PDMACH2_IRQn PDMACH2_5_IRQn
#define PDMACH3_IRQn PDMACH2_5_IRQn
#define PDMACH4_IRQn PDMACH2_5_IRQn
#define PDMACH5_IRQn PDMACH2_5_IRQn

/**
  * @}
  */

#include "core_cm0plus.h"              /* Cortex-M0+ processor and core peripherals                         */
#include "system_ht32f7xxxx_01.h"      /* HT32 system                                                       */


