ht32-holtek/HT32_STD_7xxxx_FWLib/library/Device/Holtek/HT32F7xxxx/Include/ht32f7xxxx_01.h
  #define SCI_IRQn               SCI0_1_CAN0_IRQn
  #define SCI_IRQHandler         SCI0_1_CAN0_IRQHandler
  #define CAN0_IRQn              SCI0_1_CAN0_IRQn
  #define CAN0_IRQHandler        SCI0_1_CAN0_IRQHandler

  #define I2S_IRQn               I2S_CAN1_IRQn
  #define I2S_IRQHandler         I2S_CAN1_IRQHandler
  #define CAN1_IRQn              I2S_CAN1_IRQn
  #define CAN1_IRQHandler        I2S_CAN1_IRQHandler
#endif

// ht32f7xxxx_board_01.c
#define HT32F_DVB_USBConnect                HT32_DVB_USBConnect
#define HT32F_DVB_USBDisConnect             HT32_DVB_USBDisConnect

#define HT32F_DVB_GPxConfig                 HT32_DVB_GPxConfig

#define HT32F_DVB_BuzzerInit                HT32_DVB_BuzzerInit
#define HT32F_DVB_BuzzerConfig              HT32_DVB_BuzzerConfig
#define HT32F_DVB_LEDInit                   HT32_DVB_LEDInit
#define HT32F_DVB_LEDOn                     HT32_DVB_LEDOn
#define HT32F_DVB_LEDOff                    HT32_DVB_LEDOff
#define HT32F_DVB_LEDToggle                 HT32_DVB_LEDToggle

#define HT32F_DVB_PBInit                    HT32_DVB_PBInit
#define HT32F_DVB_PBGetState                HT32_DVB_PBGetState

#define HT32F_DVB_COMInit                   HT32_DVB_COMInit

#define HT32F_DVB_BuzzerFun                 HT32_DVB_BuzzerFun
#define HT32F_DVB_BuzzerOutputCmd           HT32_DVB_BuzzerOutputCmd

/**
 * @brief Global functions
 */
/*******************************************************************************************************//**
 * @brief Corrects the error value within a single error bit address.
 * @return The address of the value of the single error correction.
 **********************************************************************************************************/
__STATIC_INLINE u32 RAMECC_CorrectSingleAddrVal(void)
{
  u32 addr = HT_SYSTEM->RAMSEAR;
  ww(addr, rw(addr));
  HT_SYSTEM->RAMISR = 0x00000001;
  return addr;
}

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif


/**
  * @}
  */

/**
  * @}
  */

/******************* (C) COPYRIGHT Holtek Semiconductor Inc. *****END OF FILE***                            */
